{
  "products": [
    {
      "id": "1",
      "name": "Nintendo Switch",
      "price": 2030,
      "imageUrl": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSyV_3_Gd9lcoHrj3vS2hITLn8WcOc9BLJpawneuHa5NYbYhV5qUlz-ZSp-FkwDkqrJlP03eHD7VHGEEmj9qOLftm0pdBmdUQ_9haC40RBAk3vrjL-4mMSF&usqp=CAc",
      "description": "Esqueça tudo que você sabia sobre os jogos The Legend of Zelda. Entre em um mundo de descoberta, exploração e aventura em The Legend of Zelda: Breath of the Wild, um novo jogo desta aclamada série que está quebrando barreiras. Explore vastos campos, florestas e topos de montanhas enquanto descobre como ficou o reino de Hyrule nesta impressionante aventura a céu aberto. Agora, no Nintendo Switch, a sua aventura é mais livre e mais aberta do que nunca. Leve o seu console para qualquer lugar e aventure-se como Link da forma que você quiser."
    },
    {
      "id": "2",
      "name": "Super Mario Odissey",
      "price": 1800,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/518mL2i0riL._AC_.jpg",
      "description": "Super Mario Odyssey traz uma nova evolução no estilo de jogo do bigodudo favorito dos vide-games! Mario embarca em uma nova jornada através de mundos desconhecidos, pulando e correndo por cenários 3D fantásticos no primeiro jogo sandbox da franquia desde Super Mario Sunshine. Parta nesta incrível viagens por mundos expansivos a bordo de uma nave, descubra novos itens, novos movimentos e muito mais!"
    },
    {
      "id": "3",
      "name": "Pokemon Shield",
      "price": 280,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/81lwcYUU9TL._AC_SY445_.jpg",
      "description": "Comece sua aventura como treinador de Pokémon, escolhendo um dos três novos Pokémon parceiros: Grookey, Scorbunny ou Sobble. Em seguida, embarque em uma jornada na nova região de Galar, onde você desafiará os criadores de problemas do Team Yell, enquanto desvenda o mistério por trás dos lendários Pokémon Zacian e Zamazenta!"
    },
    {
      "id": "4",
      "name": "Luigi's Mansion 3",
      "price": 270.4,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/719SCN8iaWL._AC_SY445_.jpg",
      "description": "Luigi foi convidado a se hospedar no suntuoso hotel Last Resort. Mas com o sumiço de Mario e seus amigos, nosso herói vestido de verde terá de superar seus medos para poder salvá-los! Golpeie, sopre e aspire os fantasmas com a novíssima Poltergust G-00, e junte suas forças com Gooigi para decifrar engenhocas e derrotar chefões endiabrados em cada piso temático deste hotel."
    },
    {
      "id": "5",
      "name": "Stardew Valley - Nintendo Switch",
      "price": 80,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/41MWR3VC1cL.png",
      "description": "Você herdou a antiga fazenda do seu avô em Stardew Valley. De posse de ferramentas usadas e de um punhado de moedas, você parte em direção à sua nova vida. Você conseguirá aprender a viver da terra e transformar o campo coberto de mato em um próspero lar? Não vai ser fácil. "
    },
    {
      "id": "6",
      "name": "Mario Kart 8 Deluxe",
      "price": 270.7,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/91KQmjDxj-L._AC_SL1500_.jpg",
      "description": "Acertar a estrada com a versão definitiva do Mario Kart 8 e jogar a qualquer hora, em qualquer lugar! Corrida seus amigos ou batalha-los em um modo de batalha revista em campos de batalha novos e de retorno. Reproduza localmente em até 4 jogadores multiplayer em 1080p enquanto estiver jogando no modo TV."
    },
    {
      "id": "7",
      "name": "Super Mario Maker 2",
      "price": 260,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/81o4tWrwkpL._AC_SY879_.jpg",
      "description": "Deixe sua imaginação correr solta com Super Mario Maker 2, exclusivamente para Nintendo Switch! Essa continuação traz diversas novidades, com mais ferramentas, objetos, personagens e funcionalidades. Prepare-se para construir sua fase perfeita em Super Mario Maker 2!"
    },
    {
      "id": "8",
      "name": "Kirby Star Allies",
      "price": 280,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/51RiwPnJpFL._AC_.jpg",
      "description": "No jogo, Kirby poderá recrutar inimigos ao acertá-los com um Friend Heart, reunindo grupos de quatro quatro personagens. Habilidades de cópia como Sword, Fire, Water, Bomb, Cleaning estão de volta, e novas habilidades de cópia como Artist e Spider serão adicionadas ao game."
    },
    {
      "id": "9",
      "name": "Sonic Mania Plus",
      "price": 252.2,
      "imageUrl": "https://encrypted-tbn3.gstatic.com/shopping?q=tbn:ANd9GcTaL2eu0h7XgnrRHUaWmH34WD73KKYInJtzxFABiOPQ5wNIbLFEbHX4UI0iI2uL1N0_ir-hgzRduiBXLBT1rMQ5xl8bbEA857dmujSZj4Dn&usqp=CAE",
      "description": "O retorno de um dos ícones dos videogames! Viva a celebração definitiva do passado e do futuro em Sonic Mania, numa nova aventura em 2D."
    },
    {
      "id": "10",
      "name": "Nintendo New Super Mario Bros",
      "price": 279.9,
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/813JPZr%2BpCL._AC_SL1500_.jpg",
      "description": "Contando com uma aventura em um cenário 2D na qual Mario deve saltar e derrotar inimigos para salvar a princesa do temível Bowser."
    }
  ]
}
